Stairs require no more than two boundaries (chains of one or more Boundary Lines).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId StairTooManyConnectedBoundariesError { get; }
  Visual Basic
Public Shared ReadOnly Property StairTooManyConnectedBoundariesError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ StairTooManyConnectedBoundariesError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace